fio4pi/results/6418-4w-rpi2-raspbian_v4.1.19-v7+.log
random-write-1: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
random-write-2: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
random-write-3: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
random-write-4: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
fio-2.6
Starting 4 processes
random-write-3: Laying out IO file(s) (1 file(s) / 1024MB)
random-write-4: Laying out IO file(s) (1 file(s) / 1024MB)

random-write-1: (groupid=0, jobs=1): err= 0: pid=2957: Sat Mar 19 17:26:05 2016
  write: io=1024.0MB, bw=307060B/s, iops=74, runt=3496846msec
    clat (usec): min=30, max=8740.3K, avg=13317.61, stdev=94036.45
     lat (usec): min=31, max=8740.3K, avg=13319.72, stdev=94036.47
    clat percentiles (usec):
     |  1.00th=[   34],  5.00th=[   36], 10.00th=[   37], 20.00th=[   38],
     | 30.00th=[   39], 40.00th=[   39], 50.00th=[   40], 60.00th=[   42],
     | 70.00th=[   45], 80.00th=[   54], 90.00th=[   82], 95.00th=[197632],
     | 99.00th=[199680], 99.50th=[199680], 99.90th=[382976], 99.95th=[1875968],
     | 99.99th=[4227072]
    bw (KB  /s): min=    0, max=16448, per=29.10%, avg=342.51, stdev=311.08
    lat (usec) : 50=76.60%, 100=15.55%, 250=2.04%, 500=0.01%, 750=0.01%
    lat (usec) : 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.04%, 20=0.01%, 50=0.03%
    lat (msec) : 100=0.02%, 250=5.57%, 500=0.02%, 750=0.01%, 1000=0.01%
    lat (msec) : 2000=0.03%, >=2000=0.05%
  cpu          : usr=0.12%, sys=0.40%, ctx=15713, majf=0, minf=21
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=262144/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
random-write-2: (groupid=0, jobs=1): err= 0: pid=2958: Sat Mar 19 17:26:05 2016
  write: io=1024.0MB, bw=308876B/s, iops=75, runt=3476283msec
    clat (usec): min=30, max=8549.3K, avg=13239.67, stdev=93972.03
     lat (usec): min=32, max=8549.3K, avg=13241.84, stdev=93972.04
    clat percentiles (usec):
     |  1.00th=[   33],  5.00th=[   35], 10.00th=[   36], 20.00th=[   37],
     | 30.00th=[   38], 40.00th=[   39], 50.00th=[   40], 60.00th=[   42],
     | 70.00th=[   45], 80.00th=[   54], 90.00th=[   83], 95.00th=[197632],
     | 99.00th=[199680], 99.50th=[199680], 99.90th=[370688], 99.95th=[1859584],
     | 99.99th=[4079616]
    bw (KB  /s): min=    0, max=28352, per=29.28%, avg=344.62, stdev=476.59
    lat (usec) : 50=76.20%, 100=15.91%, 250=2.10%, 500=0.03%, 750=0.01%
    lat (usec) : 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.04%, 20=0.01%, 50=0.02%
    lat (msec) : 100=0.03%, 250=5.54%, 500=0.02%, 750=0.01%, 1000=0.01%
    lat (msec) : 2000=0.03%, >=2000=0.04%
  cpu          : usr=0.13%, sys=0.39%, ctx=15734, majf=0, minf=20
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=262144/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
random-write-3: (groupid=0, jobs=1): err= 0: pid=2959: Sat Mar 19 17:26:05 2016
  write: io=1024.0MB, bw=301408B/s, iops=73, runt=3562417msec
    clat (usec): min=23, max=8613.2K, avg=13567.26, stdev=96581.22
     lat (usec): min=25, max=8613.2K, avg=13569.49, stdev=96581.25
    clat percentiles (usec):
     |  1.00th=[   27],  5.00th=[   32], 10.00th=[   36], 20.00th=[   38],
     | 30.00th=[   39], 40.00th=[   40], 50.00th=[   41], 60.00th=[   44],
     | 70.00th=[   53], 80.00th=[   95], 90.00th=[ 8768], 95.00th=[77312],
     | 99.00th=[199680], 99.50th=[199680], 99.90th=[864256], 99.95th=[1810432],
     | 99.99th=[4145152]
    bw (KB  /s): min=    0, max=60352, per=29.24%, avg=344.19, stdev=917.06
    lat (usec) : 50=67.51%, 100=12.84%, 250=4.18%, 500=0.60%, 750=0.07%
    lat (usec) : 1000=0.03%
    lat (msec) : 2=0.14%, 4=0.84%, 10=4.37%, 20=2.04%, 50=1.88%
    lat (msec) : 100=0.71%, 250=4.51%, 500=0.12%, 750=0.05%, 1000=0.03%
    lat (msec) : 2000=0.04%, >=2000=0.05%
  cpu          : usr=0.16%, sys=0.38%, ctx=48998, majf=0, minf=19
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=262144/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
random-write-4: (groupid=0, jobs=1): err= 0: pid=2960: Sat Mar 19 17:26:05 2016
  write: io=1024.0MB, bw=307077B/s, iops=74, runt=3496644msec
    clat (usec): min=23, max=8696.3K, avg=13316.28, stdev=92156.23
     lat (usec): min=25, max=8696.3K, avg=13318.49, stdev=92156.26
    clat percentiles (usec):
     |  1.00th=[   26],  5.00th=[   29], 10.00th=[   35], 20.00th=[   38],
     | 30.00th=[   39], 40.00th=[   40], 50.00th=[   41], 60.00th=[   44],
     | 70.00th=[   51], 80.00th=[   72], 90.00th=[ 8512], 95.00th=[96768],
     | 99.00th=[199680], 99.50th=[199680], 99.90th=[473088], 99.95th=[1843200],
     | 99.99th=[4014080]
    bw (KB  /s): min=    0, max=59560, per=29.04%, avg=341.78, stdev=879.92
    lat (usec) : 50=68.66%, 100=14.44%, 250=3.37%, 500=0.30%, 750=0.06%
    lat (usec) : 1000=0.04%
    lat (msec) : 2=0.15%, 4=0.73%, 10=2.67%, 20=1.82%, 50=2.08%
    lat (msec) : 100=0.71%, 250=4.79%, 500=0.09%, 750=0.02%, 1000=0.01%
    lat (msec) : 2000=0.03%, >=2000=0.04%
  cpu          : usr=0.15%, sys=0.40%, ctx=41382, majf=0, minf=22
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=262144/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: io=4096.0MB, aggrb=1177KB/s, minb=294KB/s, maxb=301KB/s, mint=3476283msec, maxt=3562417msec

Disk stats (read/write):
  mmcblk0: ios=19/930481, merge=0/42725, ticks=260/229840140, in_queue=229840730, util=99.94%